CurtainPanelHorizontalSpacing Property
 For Curtain Panel families, the horizontal spacing of the driving mesh.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public double CurtainPanelHorizontalSpacing { get; set; }
Visual Basic
Public Property CurtainPanelHorizontalSpacing As Double
	Get
	Set
Visual C++
public:
property double CurtainPanelHorizontalSpacing {
	double get ();
	void set (double value);
}
Exceptions
Exception | Condition
Autodesk.Revit.ExceptionsInvalidOperationException |  Thrown if this family is not the owner family of a curtain panel family document.
See Also
Family Class
Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →